# DataFrame 2차원 데이터 ( Series 들의 모음 )
import pandas as pd

data = {
    '이름' : ['채치수', '정대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협'],
    '학교' : ['북산고', '북산고', '북산고', '북산고', '북산고', '능남고', '능남고', '능남고'],
    '키' : [197, 184, 168, 187, 188, 202, 188, 190],
    '국어' : [90, 40, 80, 40, 15, 80, 55, 100],
    '영어' : [85, 35, 75, 60, 20, 100, 65, 85],
    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],
    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],
    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}
print("'이름'",":",data['이름'])
print("'학교'",":",data['학교'])
print("'키'",":",data['키'])
print("'국어'",":",data['국어'])
print("'영어'",":",data['영어'])
print("'수학'",":",data['수학'])
print("'과학'",":",data['과학'])
print("'SW특기'",":",data['SW특기'])

print("\n----------------------------------------------------------------------\n")
import pandas as pd

df = pd.DataFrame(data)
print(df)

print("\n----------------------------------------------------------------------\n")
print(df['이름'])

print("\n----------------------------------------------------------------------\n")
print(df[['이름','학교','영어']])

# 인덱스 지정
df = pd.DataFrame(data, index=['no.1','no.2','no.3','no.4','no.5','no.6','no.7','no.8'])
print("\n----------------------------------------------------------------------\n")
print(df)

# 칼럼 지정
df = pd.DataFrame(data, columns=['이름','학교','키'])
print("\n----------------------------------------------------------------------\n")
print(df)